var relearn_searchindex = [
  {
    "breadcrumb": "",
    "content": "Microsoft Fabric 워크샵에 오신 것을 환영합니다.\nMicrosoft Fabric은 통합 솔루션이 필요한 엔터프라이즈용으로 설계된 엔드투엔드 분석 및 데이터 플랫폼입니다. 데이터 이동, 처리, 수집, 변환, 실시간 이벤트 라우팅 및 보고서 작성을 포함합니다. 데이터 엔지니어링, Data Factory, 데이터 과학, 실시간 분석, Data Warehouse 및 데이터베이스를 포함한 포괄적인 서비스 제품군을 제공합니다.\nFabric을 사용하면 여러 벤더의 다양한 서비스를 어셈블할 필요가 없습니다. 대신 분석 요구 사항을 간소화하는 원활하게 통합되고 사용자 친화적인 플랫폼을 제공합니다. SaaS(Software as a Service) 모델에서 작동하는 Fabric은 단순성과 통합을 솔루션에 제공합니다.\nMicrosoft Fabric은 개별 구성 요소를 응집력 있는 스택에 통합합니다. 다른 데이터베이스 또는 Data Warehouse를 사용하는 대신 OneLake를 사용하여 데이터 스토리지를 중앙 집중화할 수 있습니다. AI 기능은 Fabric 내에 원활하게 포함되므로 수동 통합이 필요하지 않습니다. Fabric을 사용하면 비즈니스 사용자를 위해 원시 데이터를 실행 가능한 인사이트로 쉽게 전환할 수 있습니다.\nSaaS 파운데이션을 사용하여 통합 Microsoft Fabric은 SaaS(Software as a Service) 파운데이션을 기반으로 합니다. Power BI, Azure Synapse Analytics, Azure Data Factory 및 기타 서비스의 새 구성 요소와 기존 구성 요소를 통합된 환경으로 결합합니다. 그런 다음, 이러한 구성 요소는 사용자 지정 사용자 환경에 맞게 조정됩니다.\nFabric은 데이터 엔지니어링, Data Factory, 데이터 과학, Data Warehouse, 실시간 인텔리전스, 산업 솔루션 및 Power BI와 같은 워크로드를 공유 SaaS 파운데이션에 통합합니다. 이러한 각 환경은 데이터 엔지니어, 과학자 또는 웨어하우징 전문가와 같은 고유한 사용자 역할에 맞게 조정되며 특정 작업을 수행합니다. 전체 Fabric 스택에는 AI 통합이 있으며 데이터 여정을 가속화합니다. 이러한 워크로드는 자연스럽게 함께 작동하며 다음과 같은 이점을 제공합니다.\n업계에서 광범위한 심층 통합 분석에 액세스 친숙하고 습득하기 쉬운 환경 간에 공유 모든 자산에 쉽게 액세스하고 쉽게 재사용 기본 설정 분석 도구를 사용하면서 데이터를 원래 위치에 보존하는 통합 데이터 레이크 스토리지 모든 환경에서 중앙 집중식 관리 및 거버넌스 Fabric은 데이터와 서비스를 원활하게 통합하여 통합 관리, 거버넌스 및 검색을 지원합니다. 항목, 데이터 및 행 수준 액세스에 대한 보안을 보장합니다. 핵심 엔터프라이즈 기능을 중앙에서 구성할 수 있습니다. 권한은 모든 기본 서비스에서 자동으로 적용됩니다. 또한 데이터 민감도 레이블은 제품군의 항목에서 자동으로 상속됩니다. 거버넌스는 Fabric에 기본 제공되는 Purview에서 구동됩니다.\nFabric을 사용하면 크리에이터가 최상의 작업을 만드는 데 집중할 수 있으므로 기본 인프라를 통합, 관리 또는 이해할 필요가 없습니다.\n이 워크샵의 합습 결과 Lakehouse - 데이터를 레이크 하우스로 수집, 변환 및 로드하고, 다양한 차원 데이터 분석 데이터 과학 - 의미 체계 모델을 탐색해 보시고, 데이터 변환, 대규모 의미 체계 모델에서 예측하는 기계 학습 모델 학습 실시간 인텔리전스 - 실시간 인텔리전스의 스트리밍 및 쿼리 기능을 사용하여 데이터를 분석, 스트리밍 해주시고 변환하며, KQL 쿼리를 실행하여 실시간 대시보드 및 Power BI 보고서를 작성 데이터 웨어하우스\t- 데이터를 데이터 웨어하우스로 수집하고, T-SQL과 파이프라인을 사용하여 변환, 쿼리 실행, 보고서 작성",
    "description": "Microsoft Fabric 워크샵에 오신 것을 환영합니다.\nMicrosoft Fabric은 통합 솔루션이 필요한 엔터프라이즈용으로 설계된 엔드투엔드 분석 및 데이터 플랫폼입니다. 데이터 이동, 처리, 수집, 변환, 실시간 이벤트 라우팅 및 보고서 작성을 포함합니다. 데이터 엔지니어링, Data Factory, 데이터 과학, 실시간 분석, Data Warehouse 및 데이터베이스를 포함한 포괄적인 서비스 제품군을 제공합니다.\nFabric을 사용하면 여러 벤더의 다양한 서비스를 어셈블할 필요가 없습니다. 대신 분석 요구 사항을 간소화하는 원활하게 통합되고 사용자 친화적인 플랫폼을 제공합니다. SaaS(Software as a Service) 모델에서 작동하는 Fabric은 단순성과 통합을 솔루션에 제공합니다.",
    "tags": [],
    "title": "Microsoft Fabric",
    "uri": "/index.html"
  },
  {
    "breadcrumb": "Microsoft Fabric",
    "content": "Microsoft Fabric 평가판 시작 Microsoft Fabric 평가판 용량에 등록하면 Microsoft Fabric은 무료로 제공됩니다. Microsoft Fabric 평가판 용량에는 패브릭 제품 워크로드 및 패브릭 항목을 만들고 호스트하는 리소스에 대한 액세스가 포함됩니다. 패브릭 평가판 기간은 60일입니다.\n참고 평가판에 대한 더 자세한 내용을 알기 원하시면 패브릭 평가판 시작 페이지를 방문해 보세요.\nMicrosoft Fabric 페이지에 접속 후, 이메일을 입력 하고 아래쪽의 ‘제축’",
    "description": "Microsoft Fabric 평가판 시작 Microsoft Fabric 평가판 용량에 등록하면 Microsoft Fabric은 무료로 제공됩니다. Microsoft Fabric 평가판 용량에는 패브릭 제품 워크로드 및 패브릭 항목을 만들고 호스트하는 리소스에 대한 액세스가 포함됩니다. 패브릭 평가판 기간은 60일입니다.\n참고 평가판에 대한 더 자세한 내용을 알기 원하시면 패브릭 평가판 시작 페이지를 방문해 보세요.\nMicrosoft Fabric 페이지에 접속 후, 이메일을 입력 하고 아래쪽의 ‘제축’",
    "tags": [],
    "title": "무료 평가판 등록",
    "uri": "/fabric_accounts/index.html"
  },
  {
    "breadcrumb": "Microsoft Fabric",
    "content": "개요 및 아키텍처 Microsoft Fabric은 데이터 이동에서 데이터 과학, 실시간 분석 및 비즈니스 인텔리전스에 이르기까지 모든 것을 다루는 엔터프라이즈를 위한 올인원 분석 솔루션입니다. 데이터 레이크, 데이터 엔지니어링 및 데이터 통합을 포함한 포괄적인 서비스 제품군을 모두 한 곳에서 제공합니다. 자세한 내용은 Microsoft Fabric란?을 참조하세요.\n이 자습서에서는 데이터 취득에서 데이터 소비에 이르는 엔드 투 엔드 시나리오를 안내합니다. 다양한 환경과 통합 방법뿐만 아니라 이 플랫폼에서 작업할 때 제공되는 전문 및 시민 개발자 환경을 포함하여 Fabric에 대한 기본적인 이해를 구축하는 데 도움이 됩니다. 이 자습서는 참조 아키텍처, 기능 및 기능의 전체 목록 또는 특정 모범 사례의 권장 사항이 아닙니다.\n시나리오 일반적으로 조직은 트랜잭션 및 구조적 데이터 분석 요구 사항에 맞게 최신 데이터 Warehouse를 구축해 왔습니다. 빅 데이터(반정형/비정형) 데이터 분석에 대한 데이터 Lakehouse도 필요합니다. 이 두 시스템이 병렬로 운영되면서 사일로 현상, 데이터 중복, 그리고 총 소유 비용 증가를 유발했습니다.\n데이터 저장소의 통합과 Delta Lake 형식의 표준화를 사용하는 Fabric을 사용하면 사일로를 제거하고 데이터 중복을 제거하며 총 소유 비용을 크게 줄일 수 있습니다.\nFabric에서 제공하는 유연성을 통해 Lakehouse 또는 데이터 Warehouse 아키텍처를 구현하거나 함께 결합하여 간단한 구현으로 둘 다 최대한 활용할 수 있습니다. 이 자습서에서는 리테일 조직의 예를 들어 처음부터 끝까지 Lakehouse를 빌드합니다. 브론즈 계층에 원시 데이터가 있고, 실버 계층에 유효성이 검사되고 중복 제거된 데이터가 있으며, 골드 계층에 고도로 세련된 데이터가 있는 medallion 아키텍처를 사용합니다. 모든 업계의 모든 조직에 대해 Lakehouse를 구현하는 동일한 접근 방식을 취할 수 있습니다.\n이 자습서에서는 리테일 도메인의 가상 Wide World Importers 회사의 개발자가 다음 단계를 완료하는 방법을 설명합니다.\nPower BI 계정에 로그인하고 무료 Microsoft Fabric 평가판에 등록합니다. Power BI 라이선스 가 없는 경우 Power BI 무료 라이선스에 등록한 다음 Fabric 평가판을 시작할 수 있습니다.\n조직에 대한 엔드 투 엔드 Lakehouse를 빌드하고 구현합니다.\nFabric 작업 영역 만들기. Lakehouse를 만들기. 데이터를 수집하고, 데이터를 변환하고, Lakehouse에 로드합니다. Lakehouse 모드 및 SQL 분석 엔드포인트 모드에서 하나의 데이터 복사본인 OneLake를 탐색할 수도 있습니다. SQL 분석 엔드포인트를 사용하여 Lakehouse에 연결하고 DirectLake를 사용하여 Power BI 보고서를 만들어 다양한 차원의 판매 데이터를 분석합니다. 필요에 따라 파이프라인을 사용하여 데이터 수집 및 변환 흐름을 오케스트레이션하고 예약할 수 있습니다. 작업 영역 및 기타 항목을 삭제하여 리소스를 정리합니다.\n아키텍처 다음 이미지는 Lakehouse 엔드 투 엔드 아키텍처를 보여줍니다. 다음 표에는 두 가지 해당 구성 요소가 정리되어 있습니다.\n데이터 원본: Fabric을 사용하면 간소화된 데이터 수집을 위해 Azure Data Services뿐만 아니라 다른 클라우드 기반 플랫폼 및 온-프레미스 데이터 원본에 빠르고 쉽게 연결할 수 있습니다.\n수집: 200개 이상의 네이티브 커넥터를 사용하여 조직에 대한 인사이트를 빠르게 작성할 수 있습니다. 이러한 커넥터는 Fabric 파이프라인에 통합되며 데이터 흐름을 사용하여 사용자에게 친숙한 끌어서 놓기 데이터 변환을 활용합니다. 또한 Fabric의 바로 가기 기능을 사용하면 복사하거나 이동하지 않고도 기존 데이터에 연결할 수 있습니다.\n변환 및 저장: Fabric은 Delta Lake 형식으로 표준화됩니다. 즉, 모든 Fabric 엔진은 데이터를 복제하지 않고 OneLake에 저장된 동일한 데이터 세트에 액세스하고 조작할 수 있습니다. 이 스토리지 시스템은 조직의 요구 사항에 따라 medallion 아키텍처 또는 데이터 메시를 사용하여 Lakehouse를 유연하게 빌드할 수 있습니다. 코드 우선 환경을 위해 파이프라인/데이터 흐름 또는 Notebook/Spark를 활용하여 데이터 변환을 위한 하위 코드 또는 코드 없음 환경 중에서 선택할 수 있습니다.\n사용: Power BI는 보고 및 시각화를 위해 Lakehouse의 데이터를 사용할 수 있습니다. 각 Lakehouse에는 다른 보고 도구에서 Lakehouse 테이블의 데이터를 쉽게 연결하고 쿼리할 수 있도록 SQL 분석 엔드포인트라는 기본 제공 TDS 엔드포인트 가 있습니다. SQL 분석 엔드포인트는 사용자에게 SQL 연결 기능을 제공합니다.",
    "description": "개요 및 아키텍처 Microsoft Fabric은 데이터 이동에서 데이터 과학, 실시간 분석 및 비즈니스 인텔리전스에 이르기까지 모든 것을 다루는 엔터프라이즈를 위한 올인원 분석 솔루션입니다. 데이터 레이크, 데이터 엔지니어링 및 데이터 통합을 포함한 포괄적인 서비스 제품군을 모두 한 곳에서 제공합니다. 자세한 내용은 Microsoft Fabric란?을 참조하세요.\n이 자습서에서는 데이터 취득에서 데이터 소비에 이르는 엔드 투 엔드 시나리오를 안내합니다. 다양한 환경과 통합 방법뿐만 아니라 이 플랫폼에서 작업할 때 제공되는 전문 및 시민 개발자 환경을 포함하여 Fabric에 대한 기본적인 이해를 구축하는 데 도움이 됩니다. 이 자습서는 참조 아키텍처, 기능 및 기능의 전체 목록 또는 특정 모범 사례의 권장 사항이 아닙니다.",
    "tags": [],
    "title": "Lakehouse",
    "uri": "/lakehouse/index.html"
  },
  {
    "breadcrumb": "Microsoft Fabric \u003e Lakehouse",
    "content": "필수 조건 무료 Microsoft Fabric 평가판에 등록 Fabric 평가판에는 Power BI 라이선스가 필요합니다. 라이선스가 없는 경우 Power BI 무료 라이선스에 등록 작업 영역 만들기 이 단계에서는 Fabric 작업 영역을 만듭니다. 작업 영역에는 Lakehouse, 데이터 흐름, Data Factory 파이프라인, Notebook, Power BI 의미 체계 모델 및 보고서를 포함하는 이 Lakehouse 자습서에 필요한 모든 항목이 포함됩니다.\nPower BI에 로그인합니다. 작업 영역, 새로운 작업 영역를 차례로 선택합니다. 데이터 저장소의 통합과 Delta Lake 형식의 표준화를 사용하는 Fabric을 사용하면 사일로를 제거하고 데이터 중복을 제거하며 총 소유 비용을 크게 줄일 수 있습니다.\nFabric에서 제공하는 유연성을 통해 Lakehouse 또는 데이터 Warehouse 아키텍처를 구현하거나 함께 결합하여 간단한 구현으로 둘 다 최대한 활용할 수 있습니다. 이 자습서에서는 리테일 조직의 예를 들어 처음부터 끝까지 Lakehouse를 빌드합니다. 브론즈 계층에 원시 데이터가 있고, 실버 계층에 유효성이 검사되고 중복 제거된 데이터가 있으며, 골드 계층에 고도로 세련된 데이터가 있는 medallion 아키텍처를 사용합니다. 모든 업계의 모든 조직에 대해 Lakehouse를 구현하는 동일한 접근 방식을 취할 수 있습니다.\n이 자습서에서는 리테일 도메인의 가상 Wide World Importers 회사의 개발자가 다음 단계를 완료하는 방법을 설명합니다.\nPower BI 계정에 로그인하고 무료 Microsoft Fabric 평가판에 등록합니다. Power BI 라이선스 가 없는 경우 Power BI 무료 라이선스에 등록한 다음 Fabric 평가판을 시작할 수 있습니다.\n조직에 대한 엔드 투 엔드 Lakehouse를 빌드하고 구현합니다.\nFabric 작업 영역 만들기. Lakehouse를 만들기. 데이터를 수집하고, 데이터를 변환하고, Lakehouse에 로드합니다. Lakehouse 모드 및 SQL 분석 엔드포인트 모드에서 하나의 데이터 복사본인 OneLake를 탐색할 수도 있습니다. SQL 분석 엔드포인트를 사용하여 Lakehouse에 연결하고 DirectLake를 사용하여 Power BI 보고서를 만들어 다양한 차원의 판매 데이터를 분석합니다. 필요에 따라 파이프라인을 사용하여 데이터 수집 및 변환 흐름을 오케스트레이션하고 예약할 수 있습니다. 작업 영역 및 기타 항목을 삭제하여 리소스를 정리합니다.\n아키텍처 다음 이미지는 Lakehouse 엔드 투 엔드 아키텍처를 보여줍니다. 다음 표에는 두 가지 해당 구성 요소가 정리되어 있습니다.\n데이터 원본: Fabric을 사용하면 간소화된 데이터 수집을 위해 Azure Data Services뿐만 아니라 다른 클라우드 기반 플랫폼 및 온-프레미스 데이터 원본에 빠르고 쉽게 연결할 수 있습니다.\n수집: 200개 이상의 네이티브 커넥터를 사용하여 조직에 대한 인사이트를 빠르게 작성할 수 있습니다. 이러한 커넥터는 Fabric 파이프라인에 통합되며 데이터 흐름을 사용하여 사용자에게 친숙한 끌어서 놓기 데이터 변환을 활용합니다. 또한 Fabric의 바로 가기 기능을 사용하면 복사하거나 이동하지 않고도 기존 데이터에 연결할 수 있습니다.\n변환 및 저장: Fabric은 Delta Lake 형식으로 표준화됩니다. 즉, 모든 Fabric 엔진은 데이터를 복제하지 않고 OneLake에 저장된 동일한 데이터 세트에 액세스하고 조작할 수 있습니다. 이 스토리지 시스템은 조직의 요구 사항에 따라 medallion 아키텍처 또는 데이터 메시를 사용하여 Lakehouse를 유연하게 빌드할 수 있습니다. 코드 우선 환경을 위해 파이프라인/데이터 흐름 또는 Notebook/Spark를 활용하여 데이터 변환을 위한 하위 코드 또는 코드 없음 환경 중에서 선택할 수 있습니다.\n사용: Power BI는 보고 및 시각화를 위해 Lakehouse의 데이터를 사용할 수 있습니다. 각 Lakehouse에는 다른 보고 도구에서 Lakehouse 테이블의 데이터를 쉽게 연결하고 쿼리할 수 있도록 SQL 분석 엔드포인트라는 기본 제공 TDS 엔드포인트 가 있습니다. SQL 분석 엔드포인트는 사용자에게 SQL 연결 기능을 제공합니다.",
    "description": "필수 조건 무료 Microsoft Fabric 평가판에 등록 Fabric 평가판에는 Power BI 라이선스가 필요합니다. 라이선스가 없는 경우 Power BI 무료 라이선스에 등록 작업 영역 만들기 이 단계에서는 Fabric 작업 영역을 만듭니다. 작업 영역에는 Lakehouse, 데이터 흐름, Data Factory 파이프라인, Notebook, Power BI 의미 체계 모델 및 보고서를 포함하는 이 Lakehouse 자습서에 필요한 모든 항목이 포함됩니다.\nPower BI에 로그인합니다. 작업 영역, 새로운 작업 영역를 차례로 선택합니다. 데이터 저장소의 통합과 Delta Lake 형식의 표준화를 사용하는 Fabric을 사용하면 사일로를 제거하고 데이터 중복을 제거하며 총 소유 비용을 크게 줄일 수 있습니다.",
    "tags": [],
    "title": "Lakehouse 만들기",
    "uri": "/lakehouse/create_lakehouse/index.html"
  },
  {
    "breadcrumb": "Microsoft Fabric",
    "content": "",
    "description": "",
    "tags": [],
    "title": "카테고리",
    "uri": "/categories/index.html"
  },
  {
    "breadcrumb": "Microsoft Fabric",
    "content": "",
    "description": "",
    "tags": [],
    "title": "태그",
    "uri": "/tags/index.html"
  }
]
